In [2]:
!pip install pdpipe

Collecting pdpipe
  Downloading https://files.pythonhosted.org/packages/44/dc/6f4bd0b02517d19f94e10c1fbed9177bf173b2aceb63cf930ff4df9348fc/pdpipe-0.0.49-py3-none-any.whl (48kB)
     |████████████████████████████████| 51kB 1.6MB/s
Requirement already satisfied: sortedcontainers in /usr/local/lib/python3.6/dist-packages (from pdpipe) (2.1.0)
Collecting strct
  Downloading https://files.pythonhosted.org/packages/4a/c4/bd0de8562cb3731bdfcc33a4627c755a2d9c5e6e96b73546134c43acf1be/strct-0.0.30-py2.py3-none-any.whl
Collecting skutil>=0.0.15
  Downloading https://files.pythonhosted.org/packages/34/2b/1b5c9e7be3c24e1bd5ce35c2d27a5780989c3d90fcee10f3fee3074dda7f/skutil-0.0.16-py2.py3-none-any.whl
Requirement already satisfied: pandas>=0.18.0 in /usr/local/lib/python3.6/dist-packages (from pdpipe) (1.0.3)
Requirement already satisfied: tqdm in /usr/local/lib/python3.6/dist-packages (from pdpipe) (4.41.1)
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from skutil>=0.0.15->pdpipe) (1.18.4)
Collecting decore
  Downloading https://files.pythonhosted.org/packages/b4/69/9e3da3a87058d43e5b9f0f668f69da591b8b0c2763b3afbfea084582ea57/decore-0.0.1.tar.gz
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.18.0->pdpipe) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.18.0->pdpipe) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas>=0.18.0->pdpipe) (1.12.0)
Building wheels for collected packages: decore
  Building wheel for decore (setup.py) ... done
  Created wheel for decore: filename=decore-0.0.1-py2.py3-none-any.whl size=4190 sha256=8aa9e9a4b17158cb9b8fc944f1b0fb0a584c32f7eabbd30b9d5be7c5e0f3f295
  Stored in directory: /root/.cache/pip/wheels/6c/1b/9c/71fa8b5df01cc605c4b5cadcd81df76d520149ca5c02b4013b
Successfully built decore
Installing collected packages: strct, decore, skutil, pdpipe
Successfully installed decore-0.0.1 pdpipe-0.0.49 skutil-0.0.16 strct-0.0.30

# Pipelining using pandas pdpipe.

In [0]:
import pandas as pd
import numpy as np
import pdpipe as pdp

In [0]:
df = pd.read_csv("/content/datasets_4909_7459_USA_Housing.csv")

In [5]:
df.head(2)

   Avg. Area Income  ...                                            Address
0      79545.458574  ...  208 Michael Ferry Apt. 674\nLaurabury, NE 3701...
1      79248.642455  ...  188 Johnson Views Suite 079\nLake Kathleen, CA...

[2 rows x 7 columns]

In [7]:
df.shape

(5000, 7)

In [8]:

df.columns

Index(['Avg. Area Income', 'Avg. Area House Age', 'Avg. Area Number of Rooms',
       'Avg. Area Number of Bedrooms', 'Area Population', 'Price', 'Address'],
      dtype='object')

In [0]:
def size(n):
    if n<=4:
        return 'Small'
    elif 4<n<=6:
        return 'Medium'
    else:
        return 'Big'
df['House_size'] = df['Avg. Area Number of Rooms'].apply(size)

In [10]:
df.head(2)

   Avg. Area Income  ...  House_size
0      79545.458574  ...         Big
1      79248.642455  ...         Big

[2 rows x 8 columns]

# **Chaining the stages and doing the following operations - Droping the Age Column and Hot Encoding te House_Size column using Pipeline**

In [21]:
def price(x):
    if x>250000:
        return 'keep'
    else:
        return 'drop'

pipe = pdp.ColDrop('Avg. Area House Age')
pipe+= pdp.OneHotEncode('House_size')
pipe+=pdp.ApplyByCols('Price',price,'Price_tag',drop=False)
pipe+=pdp.ValDrop(['drop'],'Price_tag')
pipe+= pdp.ColDrop('Price_tag')
df4 = pipe(df)
df4.head(4)

   Avg. Area Income  ...  House_size_Small
0      79545.458574  ...                 0
1      79248.642455  ...                 0
2      61287.067179  ...                 0
3      63345.240046  ...                 0

[4 rows x 8 columns]

In [22]:
df4.shape

(4990, 8)

# Scikit Learn for Scaling

In [23]:
pipeline_scale = pdp.Scale('StandardScaler',exclude_columns=['House_size_Medium','House_size_Small'])
df5 = pipeline_scale(df4)
df5.head(5)

   Avg. Area Income  ...  House_size_Small
0          1.028113  ...         -0.024527
1          1.000175  ...         -0.024527
2         -0.690443  ...         -0.024527
3         -0.496719  ...         -0.024527
4         -0.813263  ...         -0.024527

[5 rows x 8 columns]

# NLTK Tokernizer Stage

In [28]:
pip_token = pdp.TokenizeText('Address')
df6 = pip_token(df5)
df6.head(5)

   Avg. Area Income  ...  House_size_Small
0          1.028113  ...         -0.024527
1          1.000175  ...         -0.024527
2         -0.690443  ...         -0.024527
3         -0.496719  ...         -0.024527
4         -0.813263  ...         -0.024527

[5 rows x 8 columns]

In [31]:
def extract_state(token):
    return str(token[-2])

pipestate = pdp.ApplyByCols('Address',extract_state,result_columns='State')
df7 = pipestate(df6)
df7.head(5)

   Avg. Area Income  ...  House_size_Small
0          1.028113  ...         -0.024527
1          1.000175  ...         -0.024527
2         -0.690443  ...         -0.024527
3         -0.496719  ...         -0.024527
4         -0.813263  ...         -0.024527

[5 rows x 8 columns]